## Staging: translation
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 3 to add, 1 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                   NAME                                   |
|--------|--------------------------------------------------------------------------|
| add    | `aws_iam_group.weblate_translation`                                      |
|        | `aws_iam_group_policy_attachment.translate_full_access`                  |
|        | `aws_iam_user_group_membership.weblate_translation_automatic_suggestion` |
| delete | `aws_iam_user_policy_attachment.translate_full_access`                   |
| update | `aws_iam_user.automatic_suggestion_weblate`                              |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_iam_group.weblate_translation will be created
  + resource "aws_iam_group" "weblate_translation" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "WeblateTranslation"
      + path      = "/"
      + unique_id = (known after apply)
    }

  # aws_iam_group_policy_attachment.translate_full_access will be created
  + resource "aws_iam_group_policy_attachment" "translate_full_access" {
      + group      = "WeblateTranslation"
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/TranslateFullAccess"
    }

  # aws_iam_user.automatic_suggestion_weblate will be updated in-place
  ~ resource "aws_iam_user" "automatic_suggestion_weblate" {
      + force_destroy = false
        id            = "AutomaticSuggestionWeblate"
        name          = "AutomaticSuggestionWeblate"
      ~ tags          = {
          - "AKIA34Y76DXDTSGFH2VP" = "ECS" -> null
        }
      ~ tags_all      = {
          - "AKIA34Y76DXDTSGFH2VP" = "ECS"
        } -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_iam_user_group_membership.weblate_translation_automatic_suggestion will be created
  + resource "aws_iam_user_group_membership" "weblate_translation_automatic_suggestion" {
      + groups = [
          + "WeblateTranslation",
        ]
      + id     = (known after apply)
      + user   = "AutomaticSuggestionWeblate"
    }

  # aws_iam_user_policy_attachment.translate_full_access will be destroyed
  # (because aws_iam_user_policy_attachment.translate_full_access is not in configuration)
  - resource "aws_iam_user_policy_attachment" "translate_full_access" {
      - id         = "AutomaticSuggestionWeblate-arn:aws:iam::aws:policy/TranslateFullAccess" -> null
      - policy_arn = "arn:aws:iam::aws:policy/TranslateFullAccess" -> null
      - user       = "AutomaticSuggestionWeblate" -> null
    }

Plan: 3 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.automatic_suggestion_weblate"]

18 tests, 17 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
